---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet.TotalQuantity
source: html/50ed6c01-3acd-d974-f8e1-1e61b3e1ce41.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet.TotalQuantity Property

The total count of the Equipment Loads in the LoadSet.

## Syntax (C#)
```csharp
public int TotalQuantity { get; }
```